import { createContext , useEffect, useState } from "react";


export let TokanContext=createContext();

export default  function TokanContextProvider(props){
      const [token, setToken] = useState(null);
    //  هي لما اعمل ريفيرش بسير اليوزر توكين نل بالكونسل لما اطبعه بس باللوكل ستورج ضايل متسيف هيك هيك
    // عشان لما اعمل ريفيرش يضل محتفظ بالتوكن وما يرجعني ع صفحة الريجيستر اعمل تاني تسجيل دخول 
    // لانو اصلا اول حاجه بيشتغل هوا التوكين كونتيكس لانو هوا البيرنت تاعهم كلهم
    //   المسؤؤل عنهم كلهم سار الكاونت كونتيكس
    // هي اول كمبوننت بيقوم عندي
    // فهيا اول كمبوننت هتشك فيه اللوكل ستورج
    // بعد ما الكمبوننت يقوم تبع التويكن بدي اروح اتشيك ع اللوكل ستورج جوا الديد ماونت
    // الديد ماونت كنت اعملها باليوذ ايفيكت
    // لما يكون الدبندسي فاضي تاعها في مرحله الديد ماونت بعد ما الكمبوننت يشتغل هيا بتشتغل
    // جوا اليوذ ايفيكت بدي اعمل تشيك ع اللوكل ستورج
     useEffect(() => {
         if (localStorage.getItem("userToken")) {
            //    طالما عملت سيت للتوكين هتسمع في كل الكمبوننت
            // هي سرت حتى لو عملت ريفيرش بيضل محتفظ بالداتا بيقوليش سجلي دخول تاني
            // بيروحه في حاله وحده مسحت اللوكل ستورج من عندي كدا عملت لوق اوت بأيدي 

            // فهاد هيشتغل بالاول خالص كأول كمبوننت ويست في السيت توكين التوكين فطالما هان عملت سيت توكين وفيها التوكين 
            // فهتسمع في كل كمبوننت عندي عادي
            // ما يروحه ويرجعوني للريجيستر الا اذا حذفت التوكين من اللوكل ستورج نفسها
            // كل ما بعمل ريفيرش التوكين كدا كدا عندي موجود 
            setToken(localStorage.getItem("userToken"))
         }
     
      
     }, [])
     
      return <TokanContext.Provider value={{token,setToken}}>
             {props.children}
      </TokanContext.Provider>
}