// (4).................................

import { createAsyncThunk, createSlice } from "@reduxjs/toolkit";
import axios from "axios";
import { act } from "react";
import Categories from "../Components/Categories/Categories";
let initialState={
    counter:20,
    brands:[],
    categories:[],
}
// (creatAsyncThunk)  هوا الاوبجكت الي هاخد منه انستنس واكول جواه الاي بي اي 


// (3)
// بس هاي الفنكشن هيبقالها كذا كيس 
// انا ما عملت اكشن للفنكشن ولا للاي بي اي 
// ط الاكشن بنعمل جوا الريديوسر 
// بس الريدوسر الي عنا بيعتمد ع الستيت العاديه خالص عنا اكسترا ريدوسر \
// هو خاص بالحاجه تاعت الكريت اسينك ثنك 

export let getBrands=createAsyncThunk(
    // (1)
    // بياخد مني اول حاجه التايب
    // بيبكون عباره عن اسم الساليس ع اسم الفنكشن 
    "product/getBrands",

    // (2)
    // هحط الفنكشن الي هروح اكول فيها الاي بي اي 
    // بدي كل الابلكيشن عندي يشوفها 
    async function () {
       let {data}= await axios.get("https://ecommerce.routemisr.com/api/v1/brands");
       return data;
    }

)


export let getCategories = createAsyncThunk(
    "product/getCategories",
    async function () {
        let { data } = await axios.get("https://ecommerce.routemisr.com/api/v1/categories");
        return data;
    }
);
















// ...act......................................
// (6)............................
// بس هاي الريدوسر بدي افصفص منها الريدوسر لحال والاكشن لحال عشان كل واحد هستخدمه لوحده
let productSlice=createSlice({
    //  السلايز لازم يبقالها اسم كمان 
    // عشان هالاسم هستخدمه هيكون عندي موجود اكتر من سلايز 
    name:"product",
    // في ناس بتحبش تحط الستيت هنا عادي ممكن برا تنحط بشكل طبيعي
    //  فبروح احط الانشيل ستيت برا كأوبجكت 
    // initialState:{
    //     counter:0
    // }
    // طالما هتكون اسمه نفس القيمه فبحطه مره وحده وخلاص 
    // ط لازم احط الداتا جوا الرديوسر 
    // بيكون بداخله الفنكشن الي بدي انفذها 
    initialState,
    // (5)
    // الريدوسر بتاخد الفنكشن الي عايزة انفذها 
    // بدي اعمل زر لما ادوس عليه يزود ع الكاونتر 
    reducers:{
        // دعمل هان فنكشن اسمها انكريمنت
        // دايما الفنكشن الي بتكون هان بتاخد مني ستيت وهي عباره عن الانشيل ستيت 
        increament:(state)=>{
              state.counter++;
        },
        // بدي اعمل زر تاني ينقص بالكاونتر
        decreament:(state)=>{
                  state.counter--;
        },
        // (17).......................
        // وهروح ابعتها تحت جوا الاكشن 
        increamentByValue:(state,action)=>{
            //   state.counter+=10;
            // (18)
            // الاكشن لما اطبعه جاي ع شكل اوبجكت 
            // الاوبجكت في حاجه اسمها تايب
            // هتلاقي التايب زي كأنه باث برودكت سلاش انكريمنت باي فاليو
            //  البرودكت هوا اسم الساليس عندي 
            // لانو ممكن استخدم الانكريمنت باي فاليو في ساليز تانيه 
            // عشان هيك لازم اسم الساليز يكون يونيك
            // وكمان بداخله الباي لود هي الداتاارقيمنت ونا بكول الفنكشن 
            console.log(action);
            // فهيزود هان الخمسين 
            //  كدا عملنا رايد للداتا 
               state.counter+=action.payload;
            
        }
    },
    // (4)
    extraReducers:(builder)=>{
       //    هنا هيكون الكيسسز تاعت الاي بي اي 
      //    دايما بسمي الداتا الي راجعه بلدر 
     //   هلقيت دمسك الفانكشن بتاعتي الي فوق واعطيها كيسزز 
    //    هما تلاته فل فيلد وريجكتيد وبندنج 
    //    الفل فيلد انو الداتا راحت ورجعت 
    // الريجكتيد في مشكله والبندنج راحت وما رجعت 
    // هاد كله جوا البليدر
    builder.addCase(getBrands.fulfilled , (state,action)=>{
        // (4)
        // مفروض هادي الستيت كانت بتروح تكلم الستيت انيشل الاولانيه 
        // الي مفروض هيرجعلي فيها البراندز 
        // هعمل ستيت اسمها براند واعطيها انيشل فاليو باريه فاضيه 
        // عشان اقله ادخل ع البراند واول ما اعمل كول للفنكشن في حالة الفول فيلد امسك الداتا وحطلي ياها بالبراند
        state.brands=action.payload;
        // (5 )
        // انا بدي اروح اقرا هالداتا داخل البراندز 
    })
    builder.addCase(getCategories.fulfilled,(state,action)=>{
        state.categories=action.payload
    })
   

    }


    
})


// (7)
// الاكشن هوا الميثود الي جوا هعملها ديستركت
// ط بدي كل الابلكيشن يشوفوهم بدي اعملهم اكسبورت 


//  {/* (14) */}
//  {/* انا عندي اكشن وبدي اعمله كول والاكشن هيا الميثود والاكشن لازم ينعمله دسباتش عشان اروح اغير في ستيت */}
export let{increament,decreament,increamentByValue}=productSlice.actions;
export let productReducer=productSlice.reducer;


// لو بدي الريدوسر اخده بأي اسم برا بعمل اكسبورت ديفولت 
// هلقيت بدي اعمل ري داتا من الستور 
// بدي اعمل ريد داتا من الستور 